class QAAnswers:
    A1 = "Ответ А"
    B1 = "Ответ Б"
    C1 = "Ответ С" 

    A2 = "Ответ А"
    B2 = "Ответ Б"
    C2 = "Ответ С" 
    
    A3 = "Ответ А"
    B3 = "Ответ Б"
    C3 = "Ответ С" 
    
    A4 = "Ответ А"
    B4 = "Ответ Б"
    C4 = "Ответ С" 
    
    A5 = "Ответ А"
    B5 = "Ответ Б"
    C5 = "Ответ С"  

    CORRECT_ANSWER_QA = [A1, C2, B3, A4, C5]

class AnalitixAnswer:
    A1 = "Ответ А"
    B1 = "Ответ Б"
    C1 = "Ответ С" 

    A2 = "Ответ А"
    B2 = "Ответ Б"
    C2 = "Ответ С" 
    
    A3 = "Ответ А"
    B3 = "Ответ Б"
    C3 = "Ответ С" 
    
    A4 = "Ответ А"
    B4 = "Ответ Б"
    C4 = "Ответ С" 
    
    A5 = "Ответ А"
    B5 = "Ответ Б"
    C5 = "Ответ С"  

class DeveloperAnswer:
    A1 = "Ответ А"
    B1 = "Ответ Б"
    C1 = "Ответ С" 

    A2 = "Ответ А"
    B2 = "Ответ Б"
    C2 = "Ответ С" 
    
    A3 = "Ответ А"
    B3 = "Ответ Б"
    C3 = "Ответ С" 
    
    A4 = "Ответ А"
    B4 = "Ответ Б"
    C4 = "Ответ С" 
    
    A5 = "Ответ А"
    B5 = "Ответ Б"
    C5 = "Ответ С"                 