class QAquestions:
    Q1 = "Что из этого относится к уровням тестирования ПО? (Выберете один или несколько ответов)"   
    Q2 = "Что из этого относится к 7 принципам тестирования? (Выберете один или несколько ответов)" 
    Q3 = "Какие причины, в основном, приводят к багам в ПО? (Выберете один или несколько ответов)"   
    Q4 = "Выберете из списка типы динамического тестирования. (Выберете один или несколько ответов)"    
    Q5 = "Что из этого является определением дефекта?" 
    QS1 = "Объяснить, на каком уровне тестирования могут выполняться функциональные, нефункциональные и иные виды тестов"
    QS2 = "Объяснить преимущества и недостатки независимого тестирования"
    QS3 = "Определить преимущества и риски автоматизации тестирования"

class AnalitixQuestions:
    A1 = "Что из этого не является языком программирования?"   
    A2 = "Питон животное или язык?" 
    A3 = "Что из этого не является языком программирования?"   
    A4 = "Питон животное или язык?"    
    A5 = "Что из этого не является языком программирования?"  
    AS1 = "1111"
    AS2 = "2222"
    AS3 = "3333"    

class DevelopersQuestions:
    D1 = "Какие из ниже перечисленных типов данных являются неизменяемыми? (Выберете один или несколько ответов)"   
    D2 = "Каким типом данных могут быть ключи в словарях (dict)? (Выберете один или несколько ответов)" 
    D3 = "Каковы ключевые особенности Python? (Выберете один или несколько ответов)"   
    D4 = "Какие два специальных атрибута имеет каждый объект в Python?"    
    D5 = "Что такое Дескриптор? (Выберете один или несколько ответов)"   
    DS1 = "Для чего нужна библиотека requests?"
    DS2 = "Что такое менеджеры контекста?"
    DS3 = "Написать функцию, реализующую Ряд Фибоначчи"           
          