class QAquestions:
    Q1 = "Что из этого не является языком программирования?"   
    Q2 = "Питон животное или язык?" 
    Q3 = "Что из этого не является языком программирования?"   
    Q4 = "Питон животное или язык?"    
    Q5 = "Что из этого не является языком программирования?" 

class AnalitixQuestions:
    A1 = "Что из этого не является языком программирования?"   
    A2 = "Питон животное или язык?" 
    A3 = "Что из этого не является языком программирования?"   
    A4 = "Питон животное или язык?"    
    A5 = "Что из этого не является языком программирования?"  

class DevelopersQuestions:
    D1 = "Что из этого не является языком программирования?"   
    D2 = "Питон животное или язык?" 
    D3 = "Что из этого не является языком программирования?"   
    D4 = "Питон животное или язык?"    
    D5 = "Что из этого не является языком программирования?"                