class QAquestions:
    Q1 = "Что из этого не является языком программирования?"   
    Q2 = "Питон животное или язык?" 
    Q3 = "Что из этого не является языком программирования?"   
    Q4 = "Питон животное или язык?"    
    Q5 = "Что из этого не является языком программирования?" 
    QS1 = "1111"
    QS2 = "2222"
    QS3 = "3333"

class AnalitixQuestions:
    A1 = "Что из этого не является языком программирования?"   
    A2 = "Питон животное или язык?" 
    A3 = "Что из этого не является языком программирования?"   
    A4 = "Питон животное или язык?"    
    A5 = "Что из этого не является языком программирования?"  
    AS1 = "1111"
    AS2 = "2222"
    AS3 = "3333"    

class DevelopersQuestions:
    D1 = "Что из этого не является языком программирования?"   
    D2 = "Питон животное или язык?" 
    D3 = "Что из этого не является языком программирования?"   
    D4 = "Питон животное или язык?"    
    D5 = "Что из этого не является языком программирования?"   
    DS1 = "1111"
    DS2 = "2222"
    DS3 = "3333"           
          